Tekla Open API Reference for Tekla Structures 2025
ReinforcementBase.ReinforcementVisibilityTypes Enumeration
 The available reinforcement visibility types. Only applies to bar groups and meshes. See Tekla Structures help, "Setting the visibility of reinforcement in drawings", for more information.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ReinforcementVisibilityTypes
Public Enumeration ReinforcementVisibilityTypes
Members
Member name | Value | Description
All | 1 | Shows all bars in a group or mesh.
First | 2 | Only shows the first bar in the group or mesh.
Last | 3 | Only shows the last bar in the group or mesh.
FirstAndLast | 4 | Shows the first and last bar in the group or mesh.
OneInTheMiddle | 5 | Shows one bar in the middle of the group or mesh.
TwoInTheMiddle | 6 | Shows two bars in the middle of the group or mesh.
Customized | 7 | Indicates that you have specified the location of the only visible reinforcing bar. See "Adjusting reinforcing bars" in the Tekla Structures help for more information.
See Also
Reference
Tekla.Structures.Drawing Namespace